Revit 2027 API
RebarHostData.IsValidHost Method
 Reports whether the element is a valid rebar host.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidHost()
Public Function IsValidHost As Boolean
public:
bool IsValidHost()
member IsValidHost : unit -> bool
Return Value
Boolean
 True if the referenced Element can currently host Rebar elements, false otherwise.
Remarks
 If GetRebarHostData() returns a RebarHostData object, but RebarHostData.IsValidHost() returns false, this means that the element can be made a valid rebar host, generally by setting a property like FLOOR_PARAM_IS_STRUCTURAL or by changing the element's physical material to concrete. On the other hand, if GetRebarHostData() returns null, the element cannot be made into a rebar host.
See Also
Reference
RebarHostData Class
IsValidHost Overload
Autodesk.Revit.DB.Structure Namespace